app/controllers/book_controller.rb

INSERT INTO "books" ("image_url_medium", "created_at", "title", "author", "isbn", "updated_at", "user_id", "image_url_large", "release_date", "description", "image_url_small", "amazon_url") VALUES(NULL, '2010-07-04 16:51:56', NULL, NULL, '0596518773', '2010-07-04 16:51:56', NULL, NULL, NULL, NULL, NULL, NULL)
SELECT * FROM "books" WHERE ("books"."isbn" = '0596518773') LIMIT 1
---
  def add
    isbn = params[:isbn]
    book = Book.find_or_create_from_amazon( isbn , session[:user] )

SELECT * FROM "books" WHERE ("books"."isbn" = '0596518773') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "books" WHERE ("id" IN (1))
SELECT * FROM "users" INNER JOIN "books_users" ON "users".id = "books_users".user_id WHERE ("books_users".book_id = 1 )
---
  def delete
    @book = Book.find_by_isbn( params[:isbn] )
    current_user = User.find( session[:user] )
    current_user.books.delete( @book )
    if @book.users.size == 0

SELECT * FROM "books" WHERE ("books"."id" = 9)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def tag_cloud_user
    #@tags = session[:user].tags
    @tags = User.find(session[:user]).tags

SELECT DISTINCT books.* FROM "books" LEFT OUTER JOIN taggings books_taggings ON books_taggings.taggable_id = books.id AND books_taggings.taggable_type = 'Book' LEFT OUTER JOIN tags books_tags ON books_tags.id = books_taggings.tag_id WHERE (books_tags.name IN ('ruby'))
---
  def show_for_tag
    @tag = params[:id]
    @books = Book.find_tagged_with(@tag)

SELECT * FROM "books" WHERE ("books"."id" = 82)
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) - 1 WHERE ("id" = 1)
---
  def update_tags
    @editor_id = params[:editorId]
    book_id = @editor_id.split('_')[-1]
    tags = params[:value]
    @book = Book.find(book_id)
    @book.user_id = session[:user]
    @book.tag_list = tags
    @book.save