app/controllers/cd_controller.rb

  def add
    isbn = params[:isbn]
    cd = Cd.find_or_create_from_amazon( isbn , session[:user] )
---
INSERT INTO "cds_users" ("updated_at", "cd_id", "user_id", "created_at") VALUES ('2010-07-21 19:01:33', 1, 1, '2010-07-21 19:01:33')

  def delete
    @cd = Cd.find_by_isbn( params[:isbn] )
    current_user = User.find( session[:user] )
    current_user.cds.delete( @cd )
    if @cd.users.size == 0
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "cds_users" WHERE user_id = 1 AND cd_id IN (5)
SELECT * FROM "users" INNER JOIN "cds_users" ON "users".id = "cds_users".user_id WHERE ("cds_users".cd_id = 5 )