app/controllers/dvd_controller.rb

  def add
    isbn = params[:isbn]
    dvd = Dvd.find_or_create_from_amazon( isbn , session[:user] )
---
INSERT INTO "dvds" ("isbn", "updated_at", "title", "author", "description", "image_url_large", "image_url_small", "image_url_medium", "amazon_url", "release_date", "created_at") VALUES('0743486137', '2010-07-26 20:51:01', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-07-26 20:51:01')
INSERT INTO "dvds_users" ("updated_at", "user_id", "dvd_id", "created_at") VALUES ('2010-07-21 19:01:33', 1, 1, '2010-07-21 19:01:33')
SELECT * FROM "dvds" WHERE ("dvds"."isbn" = '0743486137') LIMIT 1

  def delete
    @dvd = Dvd.find_by_isbn( params[:isbn] )
    current_user = User.find( session[:user] )
    current_user.dvds.delete( @dvd )
    if @dvd.users.size == 0
---
SELECT * FROM "dvds" WHERE ("dvds"."isbn" = '0743486137') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "dvds" WHERE ("id" IN (1))
DELETE FROM "dvds_users" WHERE user_id = 1 AND dvd_id IN (1)
SELECT * FROM "users" INNER JOIN "dvds_users" ON "users".id = "dvds_users".user_id WHERE ("dvds_users".dvd_id = 1 )

  def show
    @dvd = Dvd.find(params[:id])
---
SELECT * FROM "dvds" WHERE ("dvds"."id" = 4)

  def update_tags
    @editor_id = params[:editorId]
    dvd_id = @editor_id.split('_')[-1]
    tags = params[:value]
    @dvd = Dvd.find(dvd_id)
    @dvd.user_id = session[:user]
    @dvd.tag_list = tags
    @dvd.save
---
SELECT * FROM "dvds" WHERE ("dvds"."id" = 5)
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) + 1 WHERE ("id" = 61)