app/controllers/ratings_controller.rb

  def rate
    rateable = @rateable_class.find(params[:id])
    # Delete the old ratings for current user
    @current_user = User.find( session[:user] )
    Rating.delete_all(["rateable_type = ? AND rateable_id = ? AND user_id = ?", @rateable_class.base_class.to_s, params[:id], @current_user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "ratings" WHERE (rateable_type = 'Book' AND rateable_id = '4' AND user_id = NULL)