app/controllers/review_controller.rb

SELECT * FROM "reviews" WHERE ("reviews".book_id = 4)
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "reviews" ("updated_at", "body", "title", "user_id", "book_id", "created_at") VALUES('2010-07-22 16:30:03', 'Another review', 'Another title', 1, 4, '2010-07-22 16:30:03')
SELECT * FROM "books" WHERE ("books"."id" = 4)
---
  def create
    # The instance variable @review is populated with the content of the review form.
    @item = params[:item_type]
    @review = Review.new(params[:review])
    @review.user = User.find(session[:user])
    if Review.number_of_reviews_exceeded?
      render :text => 'Number of reviews is exceeded'
    else
      if !@review.save
        # render error message using RJS
      end
    end
    if @review.book_id
      @book = Book.find(@review.book_id)