app/controllers/user_controller.rb

  def signup
    @title = "Signup"
    if request.post? and params[:user]
      @user = User.new(params[:user])
      if User.number_of_users_exceeded?
        flash[:error] = "Number of users is exceeded"
      else
        if @user.save
---
INSERT INTO "users" ("created_at", "last_login", "updated_at", "password_salt", "last_name", "login_count", "login", "password_hash", "first_name", "email") VALUES('2010-07-03 14:15:05', NULL, '2010-07-03 14:15:05', 'oYQGo27OHQ', 'Lasante', NULL, 'plasante', 'd14e033d267b4dee821f1148754e36e1acd890d0', 'Pierre', 'pierre.lasante@gmail.com')

  def home
    current_user = User.find( session[:user] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1)